INSERT INTO mp_situation_probe (id, name, description, probe_category, type, creator, interval_sec, output_format, `engine`, is_deleted, OS_type) VALUES
('00001', '版本序列号', '版本序列号', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00002', 'CPU名称', 'CPU名称', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00003', 'CPU核数', 'CPU核数', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00004', '内存总大小', '内存总大小', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00005', '内存使用率百分比', '内存使用率百分比', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00006', '硬盘总大小', '硬盘总大小', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00007', '硬盘使用百分比', '硬盘使用百分比', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),

('00007', '主机名', '主机名', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00008', '架构', '架构', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00009', '系统名', '系统名', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00010', '系统版本', '系统版本', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),

('00011', '接口名称', '接口名称', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),

('00012', '本地IP', '本地IP', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('00013', '本地端口', '本地端口', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),

