INSERT INTO mp_situation_probe (id, name, description, probe_category, type, creator, interval_sec, output_format, `engine`, is_deleted, OS_type) VALUES
('001', '硬件信息', '板序列号、CPU名称、CPU核数、CPU主频、内存总大小、内存剩余、内存使用率、硬盘总大小、硬盘使用率', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('002', '操作系统信息', '主机名、架构、系统名称、系统版本、平台、发布版本', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('003', '网络接口信息', '名称、适配器、类型、状态、MTU、MAC地址、IP地址、发包数、收包数、发送字节数、接收字节数', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('004', '端口信息', '协议类型、本地IP、本地端口、对端ip、对端端口、inode、状态、PID、进程', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('005', '进程信息', 'PID、进程名、状态、PPID、utime、stime', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('006', '文件变更事件', '文件变更事件', 1, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('007', '注册表变更事件', '注册表变更事件', 1, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('008', '操作系统日志', '操作系统日志', 2, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('009', '应用系统日志', '应用系统日志', 2, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('010', '安全软件日志', '安全软件日志', 2, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('011', '日志文件', '日志文件', 2, 0, 'admin', 180, 'none', '', 0, '0,1,2,3');



INSERT INTO mp_situation_probe_ability (id, probe_id, name, description) VALUES
('001001', '001', '版本序列号', '版本序列号'),
('001002', '001', 'CPU名称', 'CPU名称'),
('001003', '001', 'CPU核数', 'CPU核数'),
('001004', '001', '内存总大小', '内存总大小'),
('001005', '001', '内存使用率百分比', '内存使用率百分比'),
('001006', '001', '硬盘总大小', '硬盘总大小'),
('001007', '001', '硬盘使用百分比', '硬盘使用百分比'),

('002001', '002', '主机名', '主机名'),
('002002', '002', '架构', '架构'),
('002003', '002', '系统名', '系统名'),
('002004', '002', '系统版本', '系统版本'),

('003001', '003', '接口名称', '接口名称'),

('004001', '004', '本地IP', '本地IP'),
('004002', '004', '本地端口', '本地端口'),

('005001', '005', '进程信息', '进程信息');
