INSERT INTO mp_situation_probe (id, name, description, probe_category, type, creator, interval_sec, output_format, `engine`, is_deleted, OS_type) VALUES
('001', '硬件信息', '硬件信息', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('002', '操作系统信息', '操作系统信息', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('003', '网络接口信息', '网络接口信息', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('004', '端口信息', '端口信息', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('005', '进程信息', '进程信息', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('006', '文件变更事件', '文件变更事件', 1, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('007', '注册表变更事件', '注册表变更事件', 1, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('008', '系统日志', '系统日志', 3, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('009', '应用系统日志', '应用系统日志', 3, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('010', '安全软件日志', '安全软件日志', 3, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('011', '日志文件', '日志文件', 3, 0, 'admin', 180, 'none', '', 0, '0,1,2,3');



INSERT INTO mp_situation_probe_ability (id, probe_id, name, description) VALUES
('001001', '001', '版本序列号', '版本序列号'),
('001002', '001', 'CPU名称', 'CPU名称'),
('001003', '001', 'CPU核数', 'CPU核数'),
('001004', '001', '内存总大小', '内存总大小'),
('001005', '001', '内存使用率百分比', '内存使用率百分比'),
('001006', '001', '硬盘总大小', '硬盘总大小'),
('001007', '001', '硬盘使用百分比', '硬盘使用百分比'),

('002001', '002', '主机名', '主机名'),
('002002', '002', '架构', '架构'),
('002003', '002', '系统名', '系统名'),
('002004', '002', '系统版本', '系统版本'),

('003001', '003', '接口名称', '接口名称'),

('004001', '004', '本地IP', '本地IP'),
('004002', '004', '本地端口', '本地端口'),

('005001', '005', '进程信息', '进程信息');
