INSERT INTO mp_situation_probe (id, name, description, probe_category, type, creator, interval_sec, output_format, `engine`, is_deleted, OS_type) VALUES
('001', '硬件信息', '板序列号、CPU名称、CPU核数、CPU主频、内存总大小、内存剩余、内存使用率、硬盘总大小、硬盘使用率', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('002', '操作系统信息', '主机名、架构、系统名称、系统版本、平台、发布版本', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('003', '网络接口信息', '名称、适配器、类型、状态、MTU、MAC地址、IP地址、发包数、收包数、发送字节数、接收字节数', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('004', '端口信息', '协议类型、本地IP、本地端口、对端ip、对端端口、inode、状态、PID、进程', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('005', '进程信息', 'PID、进程名、状态、PPID、utime、stime', 0, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('006', '文件变更事件', '文件变更事件', 1, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('007', '注册表变更事件', '注册表变更事件', 1, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('008', '操作系统', '操作系统', 2, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('009', '应用系统', '应用系统', 2, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('010', '安全软件', '安全软件', 2, 0, 'admin', 180, 'none', '', 0, '0,1,2,3'),
('011', '日志文件', '日志文件', 2, 0, 'admin', 180, 'none', '', 0, '0,1,2,3');



INSERT INTO mp_situation_probe_ability (id, probe_id, name, description, os_type) VALUES
('001001', '001', '版本序列号', '版本序列号', '0,1,2,3'),
('001002', '001', 'CPU名称', 'CPU名称', '0,1,2,3'),
('001003', '001', 'CPU核数', 'CPU核数', '0,1,2,3'),
('001004', '001', 'CPU使用率', 'CPU使用率', '0,1,2,3'),
('001005', '001', '内存总大小', '内存总大小', '0,1,2,3'),
('001006', '001', '内存使用率', '内存使用率', '0,1,2,3'),
('001007', '001', '硬盘总大小', '硬盘总大小', '0,1,2,3'),
('001008', '001', '硬盘使用率', '硬盘使用率', '0,1,2,3'),


('002001', '002', '主机名', '主机名', '0,1,2,3'),
('002002', '002', 'OS架构', 'OS架构', '0,1,2,3'),
('002003', '002', '系统名称', '系统名称', '0,1,2,3'),
('002004', '002', '系统版本', '系统版本', '0,1,2,3'),
('002005', '002', '平台', '平台', '0,1,2,3'),
('002006', '002', '发布版本', '发布版本', '0,1,2,3'),


('003001', '003', '接口名称', '接口名称', '0,1,2,3'),
('003002', '003', '适配器类型', '适配器类型', '0'),
('003003', '003', '接口状态', '接口状态', '0,1,2,3'),
('003004', '003', 'MTU', 'MTU', '0,1,2,3'),
('003005', '003', 'MAC', 'MAC', '0,1,2,3'),
('003006', '003', '发包数', '发包数', '0,1,2,3'),
('003007', '003', '收包数', '收包数', '0,1,2,3'),
('003008', '003', '发送字节数', '发送字节数', '0,1,2,3'),
('003009', '003', '接收字节数', '接收字节数', '0,1,2,3'),
('003010', '003', 'IP address', 'IP address', '0,1,2,3'),
('003011', '003', '网络掩码', '网络掩码', '0,1,2,3'),


('004001', '004', '本地IP', '本地IP', '0,1,2,3'),
('004002', '004', '本地端口', '本地端口', '0,1,2,3'),
('004003', '004', '协议', '协议', '0,1,2,3'),
('004004', '004', '对端IP', '对端IP', '0,1,2,3'),
('004005', '004', '对端端口', '对端端口', '0,1,2,3'),
('004006', '004', '端口的状态', '端口的状态', '0,1,2,3'),

('005001', '005', 'PID', 'PID', '0,1,2,3'),
('005002', '005', 'SIZE', 'SIZE', '0,1,2,3'),
('005003', '005', '进程名称', '进程名称', '0,1,2,3'),
('005004', '005', '进程状态', '进程状态', '1'),
('005005', '005', 'PPID', 'PPID', '0,1,2,3'),
('005006', '005', 'CMD', 'CMD', '0,1,2,3'),


('006001', '006', 'size变更', 'size变更', '0,1,2,3'),
('006002', '006', 'mtime变更', 'mtime变更', '0,1,2,3'),
('006003', '006', 'uid变更', 'uid变更', '0,1,2,3'),
('006004', '006', 'inode变更', 'inode变更', '0,1,2,3'),
('006005', '006', 'hash md5变更', 'hash md5变更', '0,1,2,3'),
('006006', '006', 'hash sha1变更', 'hash sha1变更', '0,1,2,3'),
('006007', '006', 'hash sha256变更', 'hash sha256变更', '0,1,2,3'),
('006008', '006', 'checksum变更', 'checksum变更', '0,1,2,3'),


('007001', '007', 'size变更', 'size变更', '0'),
('007002', '007', 'mtime变更', 'mtime变更', '0'),
('007003', '007', 'owner变更', 'owner变更', '0'),
('007004', '007', 'value变更', 'value变更', '0'),
('007005', '007', 'hash md5变更', 'hash md5变更', '0'),
('007006', '007', 'hash sha1变更', 'hash sha1变更', '0'),
('007007', '007', 'hash sha256变更', 'hash sha256变更', '0'),
('007008', '007', 'checksum变更', 'checksum变更', '0'),

('008001', '008', '自定义添加日志路径或日志文件', '自定义添加日志路径或日志文件', '0,1,2,3'),

