package cn.cyberpeace.mp.collection;

import com.alibaba.fastjson.JSON;
import lombok.Data;

import java.util.Collections;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

public class Tool3 {
    public static void main(String[] args) {
        String targetCount = targetStr();
        List<EEE> teamTargetCounts = JSON.parseArray(targetCount, EEE.class);
        Map<String, EEE> team2Targets = new HashMap<>();
        teamTargetCounts.forEach(t -> team2Targets.put(t.getName(), t));

        String typeCount = typeStr();
        List<EEE> teamTypeCounts = JSON.parseArray(typeCount, EEE.class);
        Map<String, EEE> team2Types = new HashMap<>();
        teamTypeCounts.forEach(t -> team2Types.put(t.getName(), t));

        String totalCount = count();
        List<Num> nums = JSON.parseArray(totalCount, Num.class);
        Map<String, Num> team2Nums = new HashMap<>();
        nums.forEach(n -> team2Nums.put(n.team, n));

        System.out.println();

        Collections.sort(nums, (n1, n2) -> {
            return n2.getCount() - n1.getCount();
        });

        for (Num num : nums) {
            String team = num.team;
            for (int i = 0; i < 5; i++) {
                if (i == 0) {
                    System.out.print(team + "\t");
                    System.out.print(team2Nums.get(team).count + "\t");
                } else {
                    System.out.print(" \t \t");
                }

                System.out.print(team2Targets.get(team).entries.get(i).name + "\t");
                System.out.print(team2Targets.get(team).entries.get(i).count + "\t");

                System.out.print(team2Types.get(team).entries.get(i).name + "\t");
                System.out.println(team2Types.get(team).entries.get(i).count + "\t");
            }
        }

        System.out.println();

    }

    @Data
    public static class Num {
        private String team;
        private Integer count;
    }

    @Data
    public static class EEE {
        private String name;
        private List<EE> entries;
    }

    @Data
    public static class EE {
        private String name;
        private Integer count;
    }

    public static String count() {
        return "[\n" +
                "            {\n" +
                "                \"team\": \"ROIS\",\n" +
                "                \"count\": 283535,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.199.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 2369507891\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"M01N\",\n" +
                "                \"count\": 253659,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.228.60\",\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"未知流量\",\n" +
                "                    \"木马攻击\"\n" +
                "                ],\n" +
                "                \"size\": 6284909807\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"小游戏,4399小游戏,小游戏大全,双人小游戏大全\",\n" +
                "                \"count\": 221822,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.233.41\",\n" +
                "                    \"172.29.228.60\",\n" +
                "                    \"172.29.220.33\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击尝试\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"$category\",\n" +
                "                    \"web漏洞尝试利用\"\n" +
                "                ],\n" +
                "                \"size\": 2201225663\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Venom\",\n" +
                "                \"count\": 200879,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.211.21\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.195.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"违反隐私策略\",\n" +
                "                    \"异常登录\",\n" +
                "                    \"文件攻击\"\n" +
                "                ],\n" +
                "                \"size\": 4962607826\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"天枢Dubhe\",\n" +
                "                \"count\": 200422,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"192.168.1.250\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"其他攻击\",\n" +
                "                    \"web漏洞尝试利用\"\n" +
                "                ],\n" +
                "                \"size\": 5555495538\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"wgpsec\",\n" +
                "                \"count\": 196710,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.195.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 739125732\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Root\",\n" +
                "                \"count\": 196249,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"其他攻击\",\n" +
                "                    \"网络扫描\"\n" +
                "                ],\n" +
                "                \"size\": 1771395939\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"风信子\",\n" +
                "                \"count\": 185098,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 2216482798\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"SU\",\n" +
                "                \"count\": 184435,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"其他攻击\"\n" +
                "                ],\n" +
                "                \"size\": 3120344745\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"D1no\",\n" +
                "                \"count\": 184206,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.228.60\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"$category\",\n" +
                "                    \"提权攻击尝试\",\n" +
                "                    \"木马攻击\"\n" +
                "                ],\n" +
                "                \"size\": 844724141\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"签个到我就跑\",\n" +
                "                \"count\": 184118,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"木马攻击\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"ROOT提权攻击尝试\"\n" +
                "                ],\n" +
                "                \"size\": 2974241673\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"0ops\",\n" +
                "                \"count\": 180937,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.195.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 2980126327\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"He1loW0rld\",\n" +
                "                \"count\": 180485,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.228.60\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"$category\",\n" +
                "                    \"违反隐私策略\",\n" +
                "                    \"提权攻击尝试\"\n" +
                "                ],\n" +
                "                \"size\": 2316587341\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"M3M3\",\n" +
                "                \"count\": 160445,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.131.2\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.199.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"提权攻击尝试\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"web漏洞尝试利用\"\n" +
                "                ],\n" +
                "                \"size\": 1582308752\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"AAA\",\n" +
                "                \"count\": 157889,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"其他攻击\",\n" +
                "                    \"木马攻击\"\n" +
                "                ],\n" +
                "                \"size\": 2465533178\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"DCG0512\",\n" +
                "                \"count\": 155686,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.240.100\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"其他攻击\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"异常登录\"\n" +
                "                ],\n" +
                "                \"size\": 2161909707\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"虎贲实验室\",\n" +
                "                \"count\": 153705,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"其他攻击\",\n" +
                "                    \"web漏洞尝试利用\"\n" +
                "                ],\n" +
                "                \"size\": 2123858341\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"HATS SG\",\n" +
                "                \"count\": 153142,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"其他攻击\"\n" +
                "                ],\n" +
                "                \"size\": 1172497089\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"NEURON\",\n" +
                "                \"count\": 150713,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"木马攻击\"\n" +
                "                ],\n" +
                "                \"size\": 1801375209\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"W&M\",\n" +
                "                \"count\": 148730,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"异常登录\",\n" +
                "                    \"其他攻击\",\n" +
                "                    \"拒绝服务攻击\"\n" +
                "                ],\n" +
                "                \"size\": 3895100499\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"AmTrain\",\n" +
                "                \"count\": 146592,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"木马攻击\",\n" +
                "                    \"违反隐私策略\",\n" +
                "                    \"web漏洞尝试利用\"\n" +
                "                ],\n" +
                "                \"size\": 1897980220\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Ginkgo\",\n" +
                "                \"count\": 144340,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"192.168.1.250\",\n" +
                "                    \"172.29.226.43\",\n" +
                "                    \"172.29.225.35\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"木马攻击\",\n" +
                "                    \"违反隐私策略\",\n" +
                "                    \"其他攻击\"\n" +
                "                ],\n" +
                "                \"size\": 1411074293\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"GeronticD1no\",\n" +
                "                \"count\": 141023,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.224.28\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.245.10\",\n" +
                "                    \"172.29.200.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"违反隐私策略\",\n" +
                "                    \"其他攻击\",\n" +
                "                    \"web漏洞尝试利用\"\n" +
                "                ],\n" +
                "                \"size\": 3729239389\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"F61d\",\n" +
                "                \"count\": 140245,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 918789686\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"BXS\",\n" +
                "                \"count\": 133110,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.230.245\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"其他攻击\",\n" +
                "                    \"$category\",\n" +
                "                    \"违反隐私策略\",\n" +
                "                    \"web漏洞尝试利用\"\n" +
                "                ],\n" +
                "                \"size\": 1837415884\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"甲方带着他的供应商\",\n" +
                "                \"count\": 132494,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.136.2\",\n" +
                "                    \"172.29.131.2\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 1229021626\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"L\",\n" +
                "                \"count\": 132354,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.225.35\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"异常登录\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"凭证窃取\"\n" +
                "                ],\n" +
                "                \"size\": 2322531258\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"A1natas\",\n" +
                "                \"count\": 128459,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 2148463572\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"老坛酸菜鱼\",\n" +
                "                \"count\": 124059,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"10.10.100.1\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"其他攻击\"\n" +
                "                ],\n" +
                "                \"size\": 1861302930\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"SKR\",\n" +
                "                \"count\": 123926,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.195.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"木马攻击\",\n" +
                "                    \"违反隐私策略\"\n" +
                "                ],\n" +
                "                \"size\": 648612853\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Polaris\",\n" +
                "                \"count\": 122431,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"违反隐私策略\"\n" +
                "                ],\n" +
                "                \"size\": 1482316862\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"W4terDr0p\",\n" +
                "                \"count\": 122100,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"木马攻击\",\n" +
                "                    \"小规模信息泄漏\"\n" +
                "                ],\n" +
                "                \"size\": 818283177\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"L3H_Sec_^v^\",\n" +
                "                \"count\": 121135,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 392138062\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"0RAYS\",\n" +
                "                \"count\": 120790,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"其他攻击\"\n" +
                "                ],\n" +
                "                \"size\": 753915962\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"bi0s\",\n" +
                "                \"count\": 120537,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.199.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 414490838\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"123木头人\",\n" +
                "                \"count\": 119718,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 799795952\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"P4\",\n" +
                "                \"count\": 119153,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 837581197\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"金贵面馆\",\n" +
                "                \"count\": 119038,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"ROOT提权攻击尝试\",\n" +
                "                    \"web漏洞尝试利用\",\n" +
                "                    \"其他攻击\"\n" +
                "                ],\n" +
                "                \"size\": 877292765\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Redbud\",\n" +
                "                \"count\": 118591,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.199.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 624016832\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"EDISEC\",\n" +
                "                \"count\": 117478,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 473317530\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"维密柠檬茶\",\n" +
                "                \"count\": 117423,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 343061893\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"自宅警备队\",\n" +
                "                \"count\": 116381,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 478401673\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"b3f0re\",\n" +
                "                \"count\": 115670,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 730139512\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"bad_cat\",\n" +
                "                \"count\": 114801,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"web漏洞尝试利用\"\n" +
                "                ],\n" +
                "                \"size\": 753985693\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"perfect.blue\",\n" +
                "                \"count\": 114152,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 499168521\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Project Sekai\",\n" +
                "                \"count\": 114041,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.199.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 298404899\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"dcua\",\n" +
                "                \"count\": 113165,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 281626612\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"ALLES\",\n" +
                "                \"count\": 111884,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 208104240\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Social Engineering Experts\",\n" +
                "                \"count\": 111810,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.199.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 466596679\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"zer0pts\",\n" +
                "                \"count\": 111663,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 335471443\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"idek\",\n" +
                "                \"count\": 111354,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 207118440\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"WreckTheLine\",\n" +
                "                \"count\": 111189,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 206811540\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"护网先锋\",\n" +
                "                \"count\": 111140,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\",\n" +
                "                    \"其他攻击\"\n" +
                "                ],\n" +
                "                \"size\": 661023193\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Syclover\",\n" +
                "                \"count\": 111117,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.200.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 1141415306\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"DiceGang\",\n" +
                "                \"count\": 110555,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.142.2\",\n" +
                "                    \"172.29.131.2\",\n" +
                "                    \"172.29.136.2\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.198.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 205632300\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Nu1L\",\n" +
                "                \"count\": 109177,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 811030905\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Maple Bacon\",\n" +
                "                \"count\": 109133,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 202987380\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Super Guesser\",\n" +
                "                \"count\": 109009,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.206.16\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.198.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 221393308\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"Arr3stY0u\",\n" +
                "                \"count\": 108387,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.142.2\",\n" +
                "                    \"172.29.4.9\",\n" +
                "                    \"172.29.116.200\",\n" +
                "                    \"172.29.131.2\",\n" +
                "                    \"172.29.136.2\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.200.6\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 926579650\n" +
                "            },\n" +
                "            {\n" +
                "                \"team\": \"SAINTSEC\",\n" +
                "                \"count\": 108278,\n" +
                "                \"attack_target_ip\": [\n" +
                "                    \"172.29.192.6\",\n" +
                "                    \"172.29.192.16\",\n" +
                "                    \"172.29.200.16\",\n" +
                "                    \"172.29.195.16\",\n" +
                "                    \"172.29.206.6\",\n" +
                "                    \"172.29.195.6\",\n" +
                "                    \"172.29.198.6\",\n" +
                "                    \"172.29.199.6\",\n" +
                "                    \"172.29.200.6\",\n" +
                "                    \"172.29.206.16\"\n" +
                "                ],\n" +
                "                \"attack_types\": [\n" +
                "                    \"通用协议命令解码\",\n" +
                "                    \"信息泄露\",\n" +
                "                    \"成功拒绝服务攻击\",\n" +
                "                    \"构造流量攻击\",\n" +
                "                    \"Web应用攻击\",\n" +
                "                    \"提权攻击失败\",\n" +
                "                    \"$category\"\n" +
                "                ],\n" +
                "                \"size\": 487738745\n" +
                "            }\n" +
                "        ]";
    }

    public static String typeStr() {
        return "[\n" +
                "            {\n" +
                "                \"name\": \"ROIS\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 120472,\n" +
                "                        \"percent\": 0.41292463145194735\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 54558,\n" +
                "                        \"percent\": 0.18700064780824877\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 33100,\n" +
                "                        \"percent\": 0.11345213245450775\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 28376,\n" +
                "                        \"percent\": 0.0972603537924203\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 26819,\n" +
                "                        \"percent\": 0.09192364774312518\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"金贵面馆\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 42388,\n" +
                "                        \"percent\": 0.35417484813796674\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21157,\n" +
                "                        \"percent\": 0.17677826889815426\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17375,\n" +
                "                        \"percent\": 0.1451775971123236\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15973,\n" +
                "                        \"percent\": 0.13346312280144718\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13880,\n" +
                "                        \"percent\": 0.115974966786708\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"WreckTheLine\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 36049,\n" +
                "                        \"percent\": 0.32421372617794925\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20662,\n" +
                "                        \"percent\": 0.18582773475793468\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16574,\n" +
                "                        \"percent\": 0.14906150788297404\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15594,\n" +
                "                        \"percent\": 0.14024768637185334\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13390,\n" +
                "                        \"percent\": 0.12042558166725126\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"zer0pts\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 35699,\n" +
                "                        \"percent\": 0.31962002650145044\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20901,\n" +
                "                        \"percent\": 0.18713068080077355\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16638,\n" +
                "                        \"percent\": 0.1489632202843534\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16266,\n" +
                "                        \"percent\": 0.14563263259678402\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13563,\n" +
                "                        \"percent\": 0.12143215270565484\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"L3H_Sec_^v^\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 39993,\n" +
                "                        \"percent\": 0.32892767259388417\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 22697,\n" +
                "                        \"percent\": 0.1866744526507986\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17926,\n" +
                "                        \"percent\": 0.1474347375520208\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16700,\n" +
                "                        \"percent\": 0.13735133979241032\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14425,\n" +
                "                        \"percent\": 0.11864030398236639\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"护网先锋\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 37765,\n" +
                "                        \"percent\": 0.33830208454640737\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20624,\n" +
                "                        \"percent\": 0.18475154750920444\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16672,\n" +
                "                        \"percent\": 0.149349195116052\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 14884,\n" +
                "                        \"percent\": 0.13333213892198403\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13329,\n" +
                "                        \"percent\": 0.11940231656081196\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"天枢Dubhe\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 82560,\n" +
                "                        \"percent\": 0.38741647270816126\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 38497,\n" +
                "                        \"percent\": 0.18064888505143029\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 30142,\n" +
                "                        \"percent\": 0.1414426758765673\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 26176,\n" +
                "                        \"percent\": 0.12283204444778137\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 18350,\n" +
                "                        \"percent\": 0.08610819130565357\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"维密柠檬茶\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 37673,\n" +
                "                        \"percent\": 0.32078235028652685\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21856,\n" +
                "                        \"percent\": 0.1861019575786991\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 17341,\n" +
                "                        \"percent\": 0.14765712144821655\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17105,\n" +
                "                        \"percent\": 0.14564760177450806\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14304,\n" +
                "                        \"percent\": 0.12179732802002707\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"0ops\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 71401,\n" +
                "                        \"percent\": 0.3482075365881016\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 40503,\n" +
                "                        \"percent\": 0.19752454243537038\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 33976,\n" +
                "                        \"percent\": 0.16569374747016624\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 27788,\n" +
                "                        \"percent\": 0.13551618362082\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15327,\n" +
                "                        \"percent\": 0.0747465289461749\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"He1loW0rld\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 74301,\n" +
                "                        \"percent\": 0.40068055458187957\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 27011,\n" +
                "                        \"percent\": 0.14566132972384152\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 25952,\n" +
                "                        \"percent\": 0.13995049531646866\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 25733,\n" +
                "                        \"percent\": 0.13876950123222442\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 17129,\n" +
                "                        \"percent\": 0.09237099392246423\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"风信子\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 98044,\n" +
                "                        \"percent\": 0.516728154316433\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 27236,\n" +
                "                        \"percent\": 0.14354379677453358\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 22042,\n" +
                "                        \"percent\": 0.11616949509855592\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16026,\n" +
                "                        \"percent\": 0.08446294929904079\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15388,\n" +
                "                        \"percent\": 0.08110045325181828\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"W4terDr0p\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 37552,\n" +
                "                        \"percent\": 0.30620448967277414\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 30619,\n" +
                "                        \"percent\": 0.24967179562448527\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16281,\n" +
                "                        \"percent\": 0.13275765062746153\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15312,\n" +
                "                        \"percent\": 0.12485628317718143\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13175,\n" +
                "                        \"percent\": 0.10743087322749252\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"虎贲实验室\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 51610,\n" +
                "                        \"percent\": 0.3208320123334763\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 33796,\n" +
                "                        \"percent\": 0.21009181726065038\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 23316,\n" +
                "                        \"percent\": 0.14494321254732287\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 19722,\n" +
                "                        \"percent\": 0.1226012196713974\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16252,\n" +
                "                        \"percent\": 0.10103006906498076\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"AAA\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 55374,\n" +
                "                        \"percent\": 0.3461026419905871\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 29345,\n" +
                "                        \"percent\": 0.1834142743745039\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 27374,\n" +
                "                        \"percent\": 0.1710949854056115\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 21098,\n" +
                "                        \"percent\": 0.1318682692367791\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15229,\n" +
                "                        \"percent\": 0.09518541436187833\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"F61d\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 56901,\n" +
                "                        \"percent\": 0.40545393653937967\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 22235,\n" +
                "                        \"percent\": 0.15843778279736923\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 18571,\n" +
                "                        \"percent\": 0.13232957339014814\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 17736,\n" +
                "                        \"percent\": 0.12637969488167936\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15510,\n" +
                "                        \"percent\": 0.11051810259443205\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"M01N\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 150495,\n" +
                "                        \"percent\": 0.49556936390488704\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 55518,\n" +
                "                        \"percent\": 0.18281683740504015\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"提权攻击失败\",\n" +
                "                        \"count\": 29472,\n" +
                "                        \"percent\": 0.09704920623944205\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 26755,\n" +
                "                        \"percent\": 0.08810231789278881\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 21305,\n" +
                "                        \"percent\": 0.07015585433398863\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Root\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 98795,\n" +
                "                        \"percent\": 0.4738119331833812\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 24703,\n" +
                "                        \"percent\": 0.11847336591354893\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 23920,\n" +
                "                        \"percent\": 0.1147181683460345\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 20980,\n" +
                "                        \"percent\": 0.10061819280517574\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 19816,\n" +
                "                        \"percent\": 0.09503575350940718\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"DiceGang\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 35616,\n" +
                "                        \"percent\": 0.3221563927456922\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20878,\n" +
                "                        \"percent\": 0.1888471801365836\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16422,\n" +
                "                        \"percent\": 0.14854144995703497\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15254,\n" +
                "                        \"percent\": 0.13797657274659672\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13465,\n" +
                "                        \"percent\": 0.12179458188232102\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"签个到我就跑\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 78710,\n" +
                "                        \"percent\": 0.4243584213931421\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 35378,\n" +
                "                        \"percent\": 0.19073754582704336\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 26818,\n" +
                "                        \"percent\": 0.14458701746819064\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 19321,\n" +
                "                        \"percent\": 0.10416756523614405\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14413,\n" +
                "                        \"percent\": 0.07770649126590468\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"SAINTSEC\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 36085,\n" +
                "                        \"percent\": 0.3331548382927257\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20336,\n" +
                "                        \"percent\": 0.18775216271361703\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 15556,\n" +
                "                        \"percent\": 0.14362080267373262\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15290,\n" +
                "                        \"percent\": 0.14116495711502774\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 12940,\n" +
                "                        \"percent\": 0.11946857717910131\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Syclover\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 36208,\n" +
                "                        \"percent\": 0.32550320486888357\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20008,\n" +
                "                        \"percent\": 0.17986820931884176\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16670,\n" +
                "                        \"percent\": 0.14986020838390104\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16216,\n" +
                "                        \"percent\": 0.14577883258268381\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13497,\n" +
                "                        \"percent\": 0.12133552684808112\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"M3M3\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 76824,\n" +
                "                        \"percent\": 0.4412839188475059\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 29913,\n" +
                "                        \"percent\": 0.17182294419042804\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 19860,\n" +
                "                        \"percent\": 0.11407761413505503\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16349,\n" +
                "                        \"percent\": 0.09391011649013166\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14465,\n" +
                "                        \"percent\": 0.08308825218849804\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"idek\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 35787,\n" +
                "                        \"percent\": 0.32138046230939166\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20924,\n" +
                "                        \"percent\": 0.18790523914722418\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16566,\n" +
                "                        \"percent\": 0.14876879142195162\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15901,\n" +
                "                        \"percent\": 0.14279684609443755\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13580,\n" +
                "                        \"percent\": 0.12195340984607647\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Polaris\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 41620,\n" +
                "                        \"percent\": 0.33970518617672507\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 22150,\n" +
                "                        \"percent\": 0.180789761504432\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 17677,\n" +
                "                        \"percent\": 0.14428084036631353\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17499,\n" +
                "                        \"percent\": 0.14282799262149234\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14328,\n" +
                "                        \"percent\": 0.11694608139212197\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Arr3stY0u\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 35887,\n" +
                "                        \"percent\": 0.3300469958522252\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20417,\n" +
                "                        \"percent\": 0.1877718815814886\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 15876,\n" +
                "                        \"percent\": 0.1460090312968464\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15198,\n" +
                "                        \"percent\": 0.1397735738000423\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13067,\n" +
                "                        \"percent\": 0.1201751078329486\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"GeronticD1no\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 44875,\n" +
                "                        \"percent\": 0.30199332418100083\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 38197,\n" +
                "                        \"percent\": 0.25705267974911844\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 25215,\n" +
                "                        \"percent\": 0.16968828232253896\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15029,\n" +
                "                        \"percent\": 0.1011400037686075\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 14411,\n" +
                "                        \"percent\": 0.09698107620662737\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"BXS\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 44814,\n" +
                "                        \"percent\": 0.3316902033928413\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 24822,\n" +
                "                        \"percent\": 0.18371969091393553\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 20959,\n" +
                "                        \"percent\": 0.15512774965213014\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16971,\n" +
                "                        \"percent\": 0.1256106226130207\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15655,\n" +
                "                        \"percent\": 0.11587026674956331\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"123木头人\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 38129,\n" +
                "                        \"percent\": 0.3172578484477838\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 24025,\n" +
                "                        \"percent\": 0.1999034805255319\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17973,\n" +
                "                        \"percent\": 0.14954694091510445\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16227,\n" +
                "                        \"percent\": 0.13501909587878486\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14644,\n" +
                "                        \"percent\": 0.1218475158716291\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"wgpsec\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 68274,\n" +
                "                        \"percent\": 0.33480120044722544\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 61182,\n" +
                "                        \"percent\": 0.30002353818089095\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 27161,\n" +
                "                        \"percent\": 0.13319177732880877\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17619,\n" +
                "                        \"percent\": 0.08639983523273376\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"提权攻击失败\",\n" +
                "                        \"count\": 14121,\n" +
                "                        \"percent\": 0.0692463859084757\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Ginkgo\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 59902,\n" +
                "                        \"percent\": 0.4111776173086955\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 24582,\n" +
                "                        \"percent\": 0.16873507042640234\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 20035,\n" +
                "                        \"percent\": 0.13752368139260318\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16418,\n" +
                "                        \"percent\": 0.11269597210400593\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13964,\n" +
                "                        \"percent\": 0.09585129458279563\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Super Guesser\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 35450,\n" +
                "                        \"percent\": 0.3252025062150832\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20129,\n" +
                "                        \"percent\": 0.18465447807061802\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 15886,\n" +
                "                        \"percent\": 0.14573108642405672\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15802,\n" +
                "                        \"percent\": 0.14496050784797584\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13637,\n" +
                "                        \"percent\": 0.12509976240493903\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Nu1L\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 37108,\n" +
                "                        \"percent\": 0.33984485900852635\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20413,\n" +
                "                        \"percent\": 0.18694764220494364\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 15300,\n" +
                "                        \"percent\": 0.14012143858010276\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15265,\n" +
                "                        \"percent\": 0.13980089934152082\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13028,\n" +
                "                        \"percent\": 0.11931386286415548\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"自宅警备队\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 37847,\n" +
                "                        \"percent\": 0.32511532415321576\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21738,\n" +
                "                        \"percent\": 0.18673493054780047\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17120,\n" +
                "                        \"percent\": 0.14706513989227823\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16700,\n" +
                "                        \"percent\": 0.14345723342295832\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13839,\n" +
                "                        \"percent\": 0.11888051816409102\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"bad_cat\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 36884,\n" +
                "                        \"percent\": 0.3212696089959671\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21506,\n" +
                "                        \"percent\": 0.18732307263494385\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17011,\n" +
                "                        \"percent\": 0.14817040772775178\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16476,\n" +
                "                        \"percent\": 0.14351041312811935\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13770,\n" +
                "                        \"percent\": 0.11994042175128694\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Redbud\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 38185,\n" +
                "                        \"percent\": 0.3219482994114969\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21870,\n" +
                "                        \"percent\": 0.18439202063976529\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 17700,\n" +
                "                        \"percent\": 0.14923359695125035\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17390,\n" +
                "                        \"percent\": 0.1466199011854375\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14304,\n" +
                "                        \"percent\": 0.12060098140060369\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"L\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 43952,\n" +
                "                        \"percent\": 0.31858509712960276\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 25210,\n" +
                "                        \"percent\": 0.18273412583357496\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 23318,\n" +
                "                        \"percent\": 0.16902000579878226\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16267,\n" +
                "                        \"percent\": 0.1179109886923746\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 16244,\n" +
                "                        \"percent\": 0.11774427370252247\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"A1natas\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 42321,\n" +
                "                        \"percent\": 0.3223744848757227\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 28189,\n" +
                "                        \"percent\": 0.21472588913687643\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 19056,\n" +
                "                        \"percent\": 0.1451564987545609\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15945,\n" +
                "                        \"percent\": 0.12145887765750805\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15655,\n" +
                "                        \"percent\": 0.11924984193968571\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"HATS SG\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 51140,\n" +
                "                        \"percent\": 0.320387923743414\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 27043,\n" +
                "                        \"percent\": 0.16942218658179792\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 26707,\n" +
                "                        \"percent\": 0.16731717402063664\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 21943,\n" +
                "                        \"percent\": 0.13747110306417157\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 16845,\n" +
                "                        \"percent\": 0.1055325493832188\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Maple Bacon\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 35576,\n" +
                "                        \"percent\": 0.3259875564677962\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20068,\n" +
                "                        \"percent\": 0.1838857174273593\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 15967,\n" +
                "                        \"percent\": 0.14630771627280476\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15944,\n" +
                "                        \"percent\": 0.1460969642546251\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13508,\n" +
                "                        \"percent\": 0.12377557659003234\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"小游戏,4399小游戏,小游戏大全,双人小游戏大全\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 79526,\n" +
                "                        \"percent\": 0.33929066637086214\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 37667,\n" +
                "                        \"percent\": 0.1607029340114084\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 34735,\n" +
                "                        \"percent\": 0.14819381455614383\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 26708,\n" +
                "                        \"percent\": 0.11394732687967439\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 25701,\n" +
                "                        \"percent\": 0.10965105017726941\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"AmTrain\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 66190,\n" +
                "                        \"percent\": 0.44677088395701714\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21693,\n" +
                "                        \"percent\": 0.1464239429774826\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 18203,\n" +
                "                        \"percent\": 0.12286705545655813\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16268,\n" +
                "                        \"percent\": 0.10980614504022895\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14228,\n" +
                "                        \"percent\": 0.09603650305092068\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"ALLES\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 35821,\n" +
                "                        \"percent\": 0.3201619534517893\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21132,\n" +
                "                        \"percent\": 0.1888741911265239\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16647,\n" +
                "                        \"percent\": 0.1487880304601194\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15944,\n" +
                "                        \"percent\": 0.14250473704908656\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13656,\n" +
                "                        \"percent\": 0.12205498552071789\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Project Sekai\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 36862,\n" +
                "                        \"percent\": 0.3231949498049187\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21456,\n" +
                "                        \"percent\": 0.1881197667791855\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16777,\n" +
                "                        \"percent\": 0.14709569944325107\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16154,\n" +
                "                        \"percent\": 0.14163342247161456\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13650,\n" +
                "                        \"percent\": 0.1196791021875411\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"SU\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 88028,\n" +
                "                        \"percent\": 0.4728137974744735\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 27655,\n" +
                "                        \"percent\": 0.148539846062123\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 25781,\n" +
                "                        \"percent\": 0.1384742640147385\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 19681,\n" +
                "                        \"percent\": 0.10571009619774518\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14824,\n" +
                "                        \"percent\": 0.07962229897034574\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"bi0s\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 39425,\n" +
                "                        \"percent\": 0.3270535729099265\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21856,\n" +
                "                        \"percent\": 0.18130838020340784\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17752,\n" +
                "                        \"percent\": 0.14726328538483235\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 17736,\n" +
                "                        \"percent\": 0.14713055597033498\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14624,\n" +
                "                        \"percent\": 0.12131468485059645\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"P4\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 43296,\n" +
                "                        \"percent\": 0.3550889854834741\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 22249,\n" +
                "                        \"percent\": 0.18247355039776922\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16344,\n" +
                "                        \"percent\": 0.1340441236775199\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 15230,\n" +
                "                        \"percent\": 0.12490773394570655\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14051,\n" +
                "                        \"percent\": 0.1152382514557533\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"dcua\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 36202,\n" +
                "                        \"percent\": 0.31989608369857203\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21468,\n" +
                "                        \"percent\": 0.18970026862717376\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16766,\n" +
                "                        \"percent\": 0.14815142089636646\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16151,\n" +
                "                        \"percent\": 0.14271702247985296\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13435,\n" +
                "                        \"percent\": 0.11871730524529903\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"perfect.blue\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 38812,\n" +
                "                        \"percent\": 0.33952690881097347\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20594,\n" +
                "                        \"percent\": 0.18015606410525578\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16640,\n" +
                "                        \"percent\": 0.14556651970046888\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16088,\n" +
                "                        \"percent\": 0.14073763034502065\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13697,\n" +
                "                        \"percent\": 0.119821191126041\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"老坛酸菜鱼\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 43018,\n" +
                "                        \"percent\": 0.34315297421048013\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 22680,\n" +
                "                        \"percent\": 0.18091751023045444\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 18216,\n" +
                "                        \"percent\": 0.14530834948668245\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16700,\n" +
                "                        \"percent\": 0.13321527428785668\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14497,\n" +
                "                        \"percent\": 0.11564202582940468\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"D1no\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 59440,\n" +
                "                        \"percent\": 0.3216728721101394\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 35278,\n" +
                "                        \"percent\": 0.1909147978179929\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 33082,\n" +
                "                        \"percent\": 0.17903065200450255\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 27192,\n" +
                "                        \"percent\": 0.14715559788726296\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15971,\n" +
                "                        \"percent\": 0.08643064334574423\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"0RAYS\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 46188,\n" +
                "                        \"percent\": 0.37865223807181503\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21544,\n" +
                "                        \"percent\": 0.17661911788817838\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17362,\n" +
                "                        \"percent\": 0.14233480898507953\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 14878,\n" +
                "                        \"percent\": 0.1219708148876865\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13425,\n" +
                "                        \"percent\": 0.11005902606984752\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Social Engineering Experts\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 35887,\n" +
                "                        \"percent\": 0.320932561862262\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 20939,\n" +
                "                        \"percent\": 0.18725463016785757\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 16586,\n" +
                "                        \"percent\": 0.14832634299460745\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16146,\n" +
                "                        \"percent\": 0.14439148281628675\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13656,\n" +
                "                        \"percent\": 0.12212375135260818\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"DCG0512\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 53349,\n" +
                "                        \"percent\": 0.3373401793279628\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 45204,\n" +
                "                        \"percent\": 0.28583713783465914\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 19212,\n" +
                "                        \"percent\": 0.12148268056100059\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16476,\n" +
                "                        \"percent\": 0.1041822113742997\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14203,\n" +
                "                        \"percent\": 0.08980941661502662\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"b3f0re\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 38506,\n" +
                "                        \"percent\": 0.331394047885433\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21072,\n" +
                "                        \"percent\": 0.18135187703323752\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17268,\n" +
                "                        \"percent\": 0.14861352565536948\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16268,\n" +
                "                        \"percent\": 0.1400072292889478\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 13907,\n" +
                "                        \"percent\": 0.11968776356782622\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Venom\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 70827,\n" +
                "                        \"percent\": 0.3429746063106514\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 55803,\n" +
                "                        \"percent\": 0.27022197687256666\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 26682,\n" +
                "                        \"percent\": 0.12920564820733338\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 22858,\n" +
                "                        \"percent\": 0.1106882057837953\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15653,\n" +
                "                        \"percent\": 0.07579851628024097\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"EDISEC\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 37673,\n" +
                "                        \"percent\": 0.31936826578275873\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21921,\n" +
                "                        \"percent\": 0.18583260569171167\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17582,\n" +
                "                        \"percent\": 0.14904926204423496\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16728,\n" +
                "                        \"percent\": 0.14180958113274728\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14417,\n" +
                "                        \"percent\": 0.1222183603055247\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"甲方带着他的供应商\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 46617,\n" +
                "                        \"percent\": 0.3397690995758079\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 24913,\n" +
                "                        \"percent\": 0.181578985729071\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 20181,\n" +
                "                        \"percent\": 0.14708969257007914\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 15984,\n" +
                "                        \"percent\": 0.1164997594787248\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 14895,\n" +
                "                        \"percent\": 0.10856255739712249\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"SKR\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 44069,\n" +
                "                        \"percent\": 0.35418977351272285\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 21952,\n" +
                "                        \"percent\": 0.17643182073909758\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 17472,\n" +
                "                        \"percent\": 0.1404253267107103\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16756,\n" +
                "                        \"percent\": 0.13467071739724487\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14670,\n" +
                "                        \"percent\": 0.11790519361527704\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"NEURON\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 57494,\n" +
                "                        \"percent\": 0.3776512240460848\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 25134,\n" +
                "                        \"percent\": 0.16509350306422055\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 22747,\n" +
                "                        \"percent\": 0.149414415302054\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 20540,\n" +
                "                        \"percent\": 0.13491766344151707\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14816,\n" +
                "                        \"percent\": 0.0973193817696941\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"W&M\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"通用协议命令解码\",\n" +
                "                        \"count\": 57582,\n" +
                "                        \"percent\": 0.37880402605091773\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"信息泄露\",\n" +
                "                        \"count\": 28841,\n" +
                "                        \"percent\": 0.18973093875402933\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"构造流量攻击\",\n" +
                "                        \"count\": 22480,\n" +
                "                        \"percent\": 0.14788500756529177\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"成功拒绝服务攻击\",\n" +
                "                        \"count\": 16700,\n" +
                "                        \"percent\": 0.10986119334254325\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"Web应用攻击\",\n" +
                "                        \"count\": 14134,\n" +
                "                        \"percent\": 0.09298072495230576\n" +
                "                    }\n" +
                "                ]\n" +
                "            }\n" +
                "        ]";
    }

    public static String targetStr() {
        return "[\n" +
                "            {\n" +
                "                \"name\": \"ROIS\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用云\",\n" +
                "                        \"count\": 21093,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态云\",\n" +
                "                        \"count\": 17632,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态密码机B\",\n" +
                "                        \"count\": 15882,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 13120,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态ADAS\",\n" +
                "                        \"count\": 11381,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"金贵面馆\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1745,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1735,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1718,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1695,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1679,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"WreckTheLine\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1702,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1701,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1700,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1700,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1699,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"zer0pts\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1709,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1709,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-5\",\n" +
                "                        \"count\": 1708,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1708,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1708,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"L3H_Sec_^v^\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 2125,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1872,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1782,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1782,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1782,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"护网先锋\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-2\",\n" +
                "                        \"count\": 1763,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1708,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1694,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1642,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1637,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"天枢Dubhe\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 14225,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-1\",\n" +
                "                        \"count\": 9966,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 5539,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 3717,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-2\",\n" +
                "                        \"count\": 3133,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"维密柠檬茶\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1868,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1866,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1866,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1866,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1866,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"0ops\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-4\",\n" +
                "                        \"count\": 27867,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"白盒拟态云\",\n" +
                "                        \"count\": 12257,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"白盒拟态WEB-3\",\n" +
                "                        \"count\": 2951,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 2796,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 2790,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"He1loW0rld\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 19771,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-1\",\n" +
                "                        \"count\": 3532,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 3390,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用云\",\n" +
                "                        \"count\": 2918,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 2857,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"风信子\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用WEB-1\",\n" +
                "                        \"count\": 39194,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 5576,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 3139,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"白盒拟态密码机A-2\",\n" +
                "                        \"count\": 2523,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 2052,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"虎贲实验室\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 6815,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态密码机A\",\n" +
                "                        \"count\": 6480,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"白盒拟态WEB-3\",\n" +
                "                        \"count\": 5317,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态云\",\n" +
                "                        \"count\": 5282,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 2572,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"W4terDr0p\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-1\",\n" +
                "                        \"count\": 10511,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1637,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1635,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1635,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1635,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"AAA\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 6033,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 3099,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 3097,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 2939,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 2847,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"M01N\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 99101,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 3625,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 3354,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态ADAS\",\n" +
                "                        \"count\": 2944,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 2718,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"F61d\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 17386,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1923,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1922,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1922,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1922,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Root\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 50573,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 7677,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-1\",\n" +
                "                        \"count\": 7638,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 3626,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用云\",\n" +
                "                        \"count\": 3441,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"DiceGang\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1723,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1720,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1719,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1293,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"白盒拟态T-BOX-3\",\n" +
                "                        \"count\": 1292,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"签个到我就跑\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 6986,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 3514,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态ADAS\",\n" +
                "                        \"count\": 3327,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 3092,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 2778,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Syclover\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1702,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1698,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-5\",\n" +
                "                        \"count\": 1695,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1694,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1692,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"SAINTSEC\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1657,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1650,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1641,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1633,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1632,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"M3M3\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 26608,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1852,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1844,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1400,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1374,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"idek\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1712,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1712,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1711,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1711,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1711,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Polaris\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1931,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1890,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1890,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1889,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1889,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Arr3stY0u\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1637,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1411,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"白盒拟态T-BOX-1\",\n" +
                "                        \"count\": 1209,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"白盒拟态T-BOX-3\",\n" +
                "                        \"count\": 1209,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"白盒拟态T-BOX-2\",\n" +
                "                        \"count\": 1208,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"GeronticD1no\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-2\",\n" +
                "                        \"count\": 8562,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-1\",\n" +
                "                        \"count\": 5485,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1357,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1347,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 1322,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"BXS\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1869,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1500,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1468,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1434,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用密码机A-3\",\n" +
                "                        \"count\": 1401,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"123木头人\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 3021,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 2015,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1803,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1725,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1722,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"wgpsec\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-5\",\n" +
                "                        \"count\": 17292,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态ADAS\",\n" +
                "                        \"count\": 10639,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 8678,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用WEB-1\",\n" +
                "                        \"count\": 8292,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 5276,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Ginkgo\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 3307,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 2782,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-1\",\n" +
                "                        \"count\": 2476,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1984,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1891,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Super Guesser\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1675,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1673,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1672,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-5\",\n" +
                "                        \"count\": 1672,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1671,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Nu1L\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1625,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1624,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1622,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1619,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1619,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"自宅警备队\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1822,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1822,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1822,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1822,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1821,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"bad_cat\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1794,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1793,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1793,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1790,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1786,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Redbud\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1894,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1894,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1894,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1893,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-5\",\n" +
                "                        \"count\": 1893,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"L\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-1\",\n" +
                "                        \"count\": 4356,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 3297,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-2\",\n" +
                "                        \"count\": 1943,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1472,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-4\",\n" +
                "                        \"count\": 1472,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"A1natas\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 4639,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 2187,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1749,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1721,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1719,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"HATS SG\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 3969,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 3495,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 3127,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 2915,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 2591,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Maple Bacon\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1667,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1666,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1665,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-5\",\n" +
                "                        \"count\": 1664,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1663,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"小游戏,4399小游戏,小游戏大全,双人小游戏大全\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 16476,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 9431,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 7476,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-1\",\n" +
                "                        \"count\": 5498,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-8\",\n" +
                "                        \"count\": 5260,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"AmTrain\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-4\",\n" +
                "                        \"count\": 1870,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1838,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 1477,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-1\",\n" +
                "                        \"count\": 1356,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1294,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"ALLES\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1724,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1722,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1721,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1720,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1720,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Project Sekai\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1766,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1766,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-5\",\n" +
                "                        \"count\": 1766,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1766,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1766,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"SU\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 26517,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 2995,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 2873,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 2364,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用WEB-3\",\n" +
                "                        \"count\": 2289,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"bi0s\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 2125,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 2124,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 2122,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 2122,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 2122,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"P4\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 2788,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 1880,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 1856,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1842,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1438,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"dcua\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1763,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1762,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-5\",\n" +
                "                        \"count\": 1762,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1761,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1761,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"perfect.blue\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1688,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1688,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1686,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-8\",\n" +
                "                        \"count\": 1685,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1684,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"老坛酸菜鱼\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1906,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1873,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1829,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1376,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1376,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"D1no\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态密码机B\",\n" +
                "                        \"count\": 10939,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 3757,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用密码机A-2\",\n" +
                "                        \"count\": 3508,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 2706,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 2678,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"0RAYS\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1582,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1578,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 1233,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1218,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1218,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Social Engineering Experts\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1716,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-5\",\n" +
                "                        \"count\": 1715,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1713,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1713,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1712,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"DCG0512\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-3\",\n" +
                "                        \"count\": 19194,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 11931,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1784,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 1461,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1393,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"Venom\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-10\",\n" +
                "                        \"count\": 16339,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-5\",\n" +
                "                        \"count\": 15759,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-2\",\n" +
                "                        \"count\": 6965,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 4580,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用路由器-3\",\n" +
                "                        \"count\": 3388,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"b3f0re\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1777,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1725,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1704,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-5\",\n" +
                "                        \"count\": 1704,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1703,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"EDISEC\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-4\",\n" +
                "                        \"count\": 1846,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1845,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-2\",\n" +
                "                        \"count\": 1845,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1845,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1841,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"甲方带着他的供应商\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 3298,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 2852,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用存储-2\",\n" +
                "                        \"count\": 2728,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用IMS HSS\",\n" +
                "                        \"count\": 2214,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-6\",\n" +
                "                        \"count\": 2179,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"SKR\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-1\",\n" +
                "                        \"count\": 1858,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1857,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-3\",\n" +
                "                        \"count\": 1857,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 1857,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1857,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"NEURON\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"黑盒拟态WEB\",\n" +
                "                        \"count\": 9872,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-7\",\n" +
                "                        \"count\": 7262,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-7\",\n" +
                "                        \"count\": 3161,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 2661,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-9\",\n" +
                "                        \"count\": 2617,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            },\n" +
                "            {\n" +
                "                \"name\": \"W&M\",\n" +
                "                \"entries\": [\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-4\",\n" +
                "                        \"count\": 2829,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"商用5G UDM\",\n" +
                "                        \"count\": 2433,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-10\",\n" +
                "                        \"count\": 1919,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"ADAS-5\",\n" +
                "                        \"count\": 1915,\n" +
                "                        \"percent\": null\n" +
                "                    },\n" +
                "                    {\n" +
                "                        \"name\": \"T-BOX-6\",\n" +
                "                        \"count\": 1612,\n" +
                "                        \"percent\": null\n" +
                "                    }\n" +
                "                ]\n" +
                "            }\n" +
                "        ]";
    }
}
